{
  "backend/main.mo": "Defines the ecommerce backend actor with product catalog, order types, authorization mixin, product queries, checkout, and user order retrieval.",
  "backend/migration.mo": "Migration module converting old catalog and order structures to newer formats including updated size variants.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten short summaries for all major frontend files describing layout, components, pages, and UI behavior.",
  "frontend/index.css": "Defines global Tailwind base styles and OKLCH color tokens for light and dark themes.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, route tree, theme provider, cart provider, and renders the app shell.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides login/logout controls using Internet Identity with a dropdown for authenticated users.",
  "frontend/src/components/auth/RequireAuth.tsx": "Auth guard component that prompts unauthenticated users to log in before accessing protected content.",
  "frontend/src/components/checkout/ShippingForm.tsx": "Form component for collecting shipping name, phone, and address with validation and change handlers.",
  "frontend/src/components/feedback/States.tsx": "Reusable loading, empty, and error UI states with optional retry support.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper providing header, footer, and routed content area.",
  "frontend/src/components/layout/Footer.tsx": "Footer with shop links, customer care links, and brand info.",
  "frontend/src/components/layout/Header.tsx": "Responsive header with navigation, search, login, cart indicator, and mobile menu.",
  "frontend/src/components/merch/CategoryFilters.tsx": "Sidebar filters for sorting and adjusting price range with reset support.",
  "frontend/src/components/merch/CategoryTiles.tsx": "Grid of category tiles linking to category pages with image slices.",
  "frontend/src/components/merch/ProductCard.tsx": "Product card showing image, name, color, size info, and price with fallback image handling.",
  "frontend/src/components/merch/ProductGallery.tsx": "Product image gallery with carousel controls, thumbnails, and fallback behavior.",
  "frontend/src/components/merch/ProductGrid.tsx": "Responsive product grid with loading skeletons and empty-state handling.",
  "frontend/src/components/merch/VariantSelector.tsx": "Size selection component mapping size codes to labels and handling user choice.",
  "frontend/src/components/navigation/CategoryNav.tsx": "Category navigation links for desktop and mobile layouts.",
  "frontend/src/hooks/auth/useAuth.ts": "Wraps identity and actor hooks to report auth state and provide login/logout helpers.",
  "frontend/src/hooks/catalog/useCatalog.ts": "Provides React Query hooks to fetch products by category, top products, and trending products via the actor API.",
  "frontend/src/hooks/catalog/useProduct.ts": "Fetches a single catalog product by ID using React Query and the actor API.",
  "frontend/src/hooks/orders/useCheckout.ts": "Defines a checkout mutation that submits cart and shipping data, then invalidates order queries.",
  "frontend/src/hooks/orders/useOrders.ts": "Loads the authenticated user’s orders using React Query and the current identity.",
  "frontend/src/hooks/useActor.ts": "Creates and caches the backend actor, rebuilding it on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth state, login/logout logic, and provides identity via React context.",
  "frontend/src/index.css": "Tailwind CSS setup with custom light/dark theme variables and base typography styles.",
  "frontend/src/lib/catalog/categories.ts": "Defines product category IDs and labels for catalog filtering.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart, allowing quantity changes, item removal, and navigation to checkout.",
  "frontend/src/pages/CategoryPage.tsx": "Displays products for a category with filtering, sorting, and error/loading states.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles shipping form input, order submission, validation, and redirects on successful checkout.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero banner, category tiles, and top/trending product grids using catalog hooks and navigation.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation details including order ID with navigation to orders or homepage.",
  "frontend/src/pages/OrdersPage.tsx": "Shows authenticated user's order history with statuses, totals, and fallback loading/error/empty states.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays detailed product info with gallery, variants, quantity, and add‑to‑cart logic using product and cart hooks.",
  "frontend/src/state/cart/CartProvider.tsx": "Provides cart context with item management, persistence via storage, and basic subtotal/item count tracking.",
  "frontend/src/state/cart/cartStorage.ts": "Handles loading, saving, and clearing cart data in localStorage with BigInt serialization.",
  "frontend/src/state/cart/cartTypes.ts": "Defines cart state and context type interfaces including item operations and computed values.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL or session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom fonts, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state describing an e‑commerce app build, required product images, existing features, and known issues about missing product images."
}